<?php

/**
 * Created by PhpStorm.
 * User: Jims
 * Date: 15/02/2018
 * Time: 22:08
 */

namespace Formation\VocabulaireBundle\Twig;

class VocabulaireExtension extends \Twig_Extension {

    public function getFilters() {
        return array(
            new \Twig_SimpleFilter('convert_utf8', array($this, 'convert_utf8')),
        );
    }
    public function convert_utf8($str) {
		$new2old = array(
 'á' => 'Ã¡',
 
 'À' => 'Ã€',
 'ä' => 'Ã¤',
 'Ä' => 'Ã„',
 'ã' => 'Ã£',
 'å' => 'Ã¥',
 'Å' => 'Ã…',
 'æ' => 'Ã¦',
 'Æ' => 'Ã†',
 'ç' => 'Ã§',
 'Ç' => 'Ã‡',
 'é' => 'Ã©',
 'É' => 'Ã‰',
 'è' => 'Ã¨',
 'È' => 'Ãˆ',
 'ê' => 'Ãª',
 'Ê' => 'ÃŠ',
 'ë' => 'Ã«',
 'Ë' => 'Ã‹',
 'í' => 'Ã-­­',
 'Í' => 'Ã',
 'ì' => 'Ã¬',
 'Ì' => 'ÃŒ',
 'î' => 'Ã®',
 'Î' => 'ÃŽ',
 'ï' => 'Ã¯',
 'Ï' => 'Ã',
 'ñ' => 'Ã±',
 'Ñ' => 'Ã‘',
 'ó' => 'Ã³',
 'Ó' => 'Ã“',
 'ò' => 'Ã²',
 'Ò' => 'Ã’',
 'ô' => 'Ã´',
 'Ô' => 'Ã”',
 'ö' => 'Ã¶',
 'Ö' => 'Ã–',
 'õ' => 'Ãµ',
 'Õ' => 'Ã•',
 'ø' => 'Ã¸',
 'Ø' => 'Ã˜',
 'œ' => 'Å“',
 'Œ' => 'Å’',
 'ß' => 'ÃŸ',
 'ú' => 'Ãº',
 'Ú' => 'Ãš',
 'ù' => 'Ã¹',
 'Ù' => 'Ã™',
 'û' => 'Ã»',
 'Û' => 'Ã›',
 'ü' => 'Ã¼',
 'Ü' => 'Ãœ',
 '€' => 'â‚¬',
 '’' => 'â€™',
 '‚' => 'â€š',
 'ƒ' => 'Æ’',
 '„' => 'â€ž',
 '…' => 'â€¦',
 '‡' => 'â€¡',
 'ˆ' => 'Ë†',
 '‰' => 'â€°',
 'Š' => 'Å ',
 '‹' => 'â€¹',
 'Ž' => 'Å½',
 '‘' => 'â€˜',
 '“' => 'â€œ',
 '•' => 'â€¢',
 '–' => 'â€“',
 '—' => 'â€”',
 '˜' => 'Ëœ',
 '™' => 'â„¢',
 'š' => 'Å¡',
 '›' => 'â€º',
 'ž' => 'Å¾',
 'Ÿ' => 'Å¸',
 '¡' => 'Â¡',
 '¢' => 'Â¢',
 '£' => 'Â£',
 '¤' => 'Â¤',
 '¥' => 'Â¥',
 '¦' => 'Â¦',
 '§' => 'Â§',
 '¨' => 'Â¨',
 '©' => 'Â©',
 'ª' => 'Âª',
 '«' => 'Â«',
 '¬' => 'Â¬',
 '®' => 'Â®',
 '¯' => 'Â¯',
 '°' => 'Â°',
 '±' => 'Â±',
 '²' => 'Â²',
 '³' => 'Â³',
 '´' => 'Â´',
 'µ' => 'Âµ',
 '¶' => 'Â¶',
 '·' => 'Â·',
 '¸' => 'Â¸',
 '¹' => 'Â¹',
 'º' => 'Âº',
 '»' => 'Â»',
 '¼' => 'Â¼',
 '½' => 'Â½',
 '¾' => 'Â¾',
 '¿' => 'Â¿',
 'à' => 'Ã ',
 '†' => 'â€ ',
 '”' => 'â€',
 'Á' => 'Ã',
 'â' => 'Ã¢',
 'Â' => 'Ã‚',
 'Ã' => 'Ãƒ',
);
 $new = array();
 $old = array();
foreach( $new2old as $key => $value ) {
   $new[] = $key;
   $old[] = $value;
}
return str_replace( $old, $new, $str );

    }

    public function getName() {
        return 'vocabulaire_extension';
    }

}
